Repository: FyraLabs/readymade
Catalog: po/*.po
Languages: fi

source: Completed
fi: Valmis

source: Installation complete. You may reboot now and enjoy your fresh system.
fi: Asennus on valmis. Voit käynistää uudelleen ja nautia sinun uudesta järjestemästä.

source: Close
fi: Lähellå

source: Reboot
fi: Käynistä uudelleen

source: Confirmation
fi: Varmistus

source: Previous
fi: Edellinen

source: Install
fi: Asemma

source: Destination
fi: Kohde

source: Next
fi: Seruraava

source: Installation Failure
fi: Asennus virhe

source: The installation process failed.
fi: Asennusprosessi epäonnistui

source: Report a bug
fi: Ilmoita virhe

source: Installation
fi: Asennus

source: Installing base system...
fi: Asentamassa kantajärjestelmää...

source: Installation Type
fi: Asennuksen Tyyppi

source: Language
fi: Kieli

source: Either test %s from this installer or start the installation now. You can always return to this screen by selecting "Installer" in the menu.
fi: Testaa %s tästä asennusohjelmasta tai aloita asentaminen nyt. Voit aina halutessasi palata tähän valikkoon valitsemalla "Asennusohjelma" valikosta.

source: Welcome to %s
fi: Tervetuloa %s

source: Try
fi: Yritä
